# ## ДЗ 1
# ### Дано предложение
# Не знаю, как там в Лондоне, я не была. Может, там собака — друг человека. А у нас управдом — друг человека!
# ### Необходимо:

# 1. Посчитать количество символов
# 2. Развернуть строку
# 3. Сделать каждое слово с большой буквы
# 4. Сделать весь текст прописными буквами
# 5. Найти число вхождений "нд", "ам", "о" в строку
# 6. Собственные упражнения
# 1. Вывести в консоль исходную строку
# --------------------------------------------------------

# 1. Вывести в консоль результат каждого шага: Например: Шаг1 - ***Количество символов - 4***

a = 'Не знаю, как там в Лондоне, я не была. Может, там собака — друг человека. А у нас управдом — друг человека!'
# print(f'исходная строка :',a)
# print(f'\nколичество символов в строке - ', len(a))
# print(f'\nисходная строка наоборот :',a[::-1])
# print(f'\nпервые заглавные буквы :',a.title())
# print(f'\nвсе буквы прописные :',a.upper())
# print(f'\nколичество "нд" в строке - {a.count("нд")}')
# print(f'\nколичество "ам" в строке - {a.count("ам")}')
# print(f'\nколичество "о" в строке - {a.count("о")}')



